<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Comment</key>
		<string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
		<key>Description</key>
		<string>Downloads the latest version of OpenShot and creates a package.</string>
		<key>Identifier</key>
		<string>com.github.fishd72.pkg.OpenShot</string>
		<key>Input</key>
		<dict>
			<key>os</key>
			<string>dmg</string>
			<key>APP_FILENAME</key>
			<string>OpenShot Video Editor</string>
			<key>NAME</key>
			<string>OpenShot</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.peshay.download.OpenShot</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%/%APP_FILENAME%.app</string>
					<key>requirement</key>
					<string>identifier "OpenShot Video Editor" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = C94ZNQ5JF3</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>bundleid</key>
					<string>com.apple.sh</string>
				</dict>
				<key>Processor</key>
				<string>AppPkgCreator</string>
			</dict>
		</array>
	</dict>
</plist>
