<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Draw.io and creates a package.</string>
		<key>Identifier</key>
		<string>com.github.fishd72.pkg.DrawIO</string>
		<key>Input</key>
		<dict>
			<key>APP_FILENAME</key>
			<string>draw.io</string>
			<key>BUNDLE_ID</key>
			<string>com.jgraph.drawio.desktop</string>
			<key>NAME</key>
			<string>draw.io</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.peshay.download.draw.io</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>AppPkgCreator</string>
			</dict>
		</array>
	</dict>
</plist>
