<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Comment</key>
		<string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
		<key>Description</key>
		<string>Downloads the latest version of AppCleaner and creates a package.</string>
		<key>Identifier</key>
		<string>com.github.fishd72.pkg.AppCleaner</string>
		<key>Input</key>
		<dict>
			<key>BUNDLE_ID</key>
			<string>net.freemacsoft.AppCleaner</string>
			<key>NAME</key>
			<string>AppCleaner</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.3</string>
		<key>ParentRecipe</key>
		<string>com.github.jleggat.AppCleaner.download</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<key>pkgdirs</key>
					<dict>
						<key>Applications</key>
						<string>0775</string>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>Unarchiver</string>
				<key>Arguments</key>
				<dict>
					<key>archive_path</key>
					<string>%pathname%</string>
					<key>destination_path</key>
					<string>%pkgroot%/Applications/</string>
					<key>purge_destination</key>
					<true/>
				</dict>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pkgroot%/Applications/AppCleaner.app</string>
					<key>requirement</key>
					<string>anchor apple generic and identifier "net.freemacsoft.AppCleaner" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = X85ZX835W9)</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%pkgroot%/Applications/AppCleaner.app/Contents/Info.plist</string>
					<key>plist_version_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
				<key>Processor</key>
				<string>Versioner</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_request</key>
					<dict>
						<key>pkgname</key>
						<string>%NAME%-%version%</string>
						<key>pkgdir</key>
						<string>%RECIPE_CACHE_DIR%</string>
						<key>id</key>
						<string>%BUNDLE_ID%</string>
						<key>chown</key>
						<array>
							<dict>
								<key>path</key>
								<string>Applications</string>
								<key>user</key>
								<string>root</string>
								<key>group</key>
								<string>admin</string>
							</dict>
						</array>
					</dict>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
