<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the current release version of Wiz CLI and creates a package to install it.</string>
    <key>Identifier</key>
    <string>com.github.fishd72.pkg.wiz-cli</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>wizcli</string>
      <key>BUNDLEID</key>
      <string>io.wiz.app.wizcli</string>
      <key>VER_REGEX</key>
      <string>Wiz\ CLI\ v\s*([\d.]+)</string>
      </dict>
    <key>MinimumVersion</key>
    <string>0.3.0</string>
    <key>ParentRecipe</key>
    <string>com.github.fishd72.download.wiz-cli</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>pattern</key>
          <string>%RECIPE_CACHE_DIR%/downloads/%NAME%</string>
          </dict>
        <key>Processor</key>
        <string>FileFinder</string>
        </dict> 
      <dict>
        <key>Arguments</key>
        <dict>
          <key>filename</key>
          <string>%found_filename%</string>
          <key>mode</key>
          <string>a+x</string>
          </dict>
        <key>Processor</key>
        <string>com.github.jessepeterson.munki.UniversalTypeClient6/ModeChanger</string>
        </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>version_argument</key>
          <string>version</string>
          </dict>
        <key>Processor</key>
        <string>com.github.fishd72.SharedProcessors/ExecutableFileVersioner</string>
        </dict>
      <dict>
        <key>Processor</key>
        <string>com.github.jazzace.processors/TextSearcher</string>
        <key>Arguments</key>
        <dict>
          <key>text_in</key>
          <string>%version%</string>
          <key>re_pattern</key>
          <string>%VER_REGEX%</string>
          <key>result_output_var_name</key>
          <string>version</string>
          </dict>
        </dict>
      <dict>
        <key>Processor</key>
        <string>PkgRootCreator</string>
        <key>Arguments</key>
        <dict>
          <key>pkgroot</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%</string>
          <key>pkgdirs</key>
          <dict>
            <key>usr</key>
            <string>0755</string>
            <key>usr/local</key>
            <string>0755</string>
            <key>usr/local/bin</key>
            <string>0755</string>
            <key>usr/local/wizcli</key>
            <string>0755</string>
            </dict>
          </dict>
        </dict>
      <dict>
        <key>Processor</key>
        <string>Copier</string>
        <key>Arguments</key>
        <dict>
          <key>source_path</key>
          <string>%pathname%</string>
          <key>destination_path</key>
          <string>%pkgroot%/usr/local/wizcli/wizcli-%version%</string>
          </dict>
        </dict>
      <dict>
        <key>Processor</key>
        <string>Symlinker</string>
        <key>Arguments</key>
        <dict>
          <key>source_path</key>
          <string>/usr/local/wizcli/wizcli-%version%</string>
          <key>destination_path</key>
          <string>%pkgroot%/usr/local/bin/%NAME%</string>
          </dict>
        </dict>
      <dict>
        <key>Comment</key>
        <string>Build the package</string>
        <key>Processor</key>
        <string>PkgCreator</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_request</key>
          <dict>
            <key>pkgname</key>
            <string>%NAME%-%version%</string>
            <key>version</key>
            <string>%version%</string>
            <key>id</key>
            <string>%BUNDLEID%</string>
            <key>chown</key>
            <array>
              <dict>
                <key>path</key>
                <string>usr</string>
                <key>user</key>
                <string>root</string>
                <key>group</key>
                <string>wheel</string>
                <key>mode</key>
                <string>0755</string>
                </dict>
              </array>
            </dict>
          </dict>
        </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>path_list</key>
          <array>
            <string>%RECIPE_CACHE_DIR%/%NAME%</string>
            </array>
          </dict>
        <key>Processor</key>
        <string>PathDeleter</string>
        </dict>
      </array>
    </dict>
  </plist>

