<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
        <key>Description</key>
        <string>Package recipe for the Puppet Development Kit.</string>
        <key>Identifier</key>
        <string>com.github.fishd72.pkg.pdk</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>PDK</string>
            <key>OS_VERSION</key>
            <string>10.12</string>
        </dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.gerardkok.download.pdk</string>
		<key>Process</key>
		<array>
            <dict>
    			<key>Processor</key>
    			<string>PkgCopier</string>
    			<key>Arguments</key>
    			<dict>
    				<key>source_pkg</key>
    				<string>%input_path%</string>
    			</dict>
    		</dict>
		</array>
	</dict>
</plist>
