<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads, packages and imports into Munki latest version of Ookla Speedtest CLI</string>
    <key>Identifier</key>
    <string>com.github.fishd72.munki.speedtest-cli</string>
    <key>Input</key>
    <dict>
      <key>DISPLAY_NAME</key>
      <string>Speedtest CLI</string>
      <key>NAME</key>
      <string>Speedtest_CLI</string>
      <key>MUNKI_CATEGORY</key>
      <string>Utilities</string>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>%NAME%</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
	<array>
	  <string>testing</string>
	</array>
        <key>category</key>
        <string>%MUNKI_CATEGORY%</string>
        <key>description</key>
        <string>Speedtest CLI brings the trusted technology and global server network behind Speedtest to the command line. Built for software developers, system administrators and computer enthusiasts alike, Speedtest CLI is the first official Linux-native Speedtest application backed by Ookla®.</string>
        <key>developer</key>
        <string>Ookla</string>
        <key>display_name</key>
        <string>%DISPLAY_NAME%</string>
        <key>name</key>
        <string>%NAME%</string>
      </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.fishd72.pkg.speedtest-cli</string>
    <key>MinimumVersion</key>
    <string>0.3.0</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pkg_path%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
      </dict>
    </array>
  </dict> 
</plist>
