<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of pgAdmin4 and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.fishd72.pkg.pgAdmin4</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>pgAdmin 4</string>
		<key>BUNDLE_ID</key>
		<string>org.pgadmin.pgAdmin4</string>
		<key>NAME</key>
		<string>pgAdmin 4</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.bnpl.autopkg.download.pgadmin4</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
