<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the latest version of the AZCopy CLI tool.</string>
    <key>Comment</key>
    <string>By default, it downloads X86, to download ARM64, add -arm64 to ARCH string.</string>
    <key>Identifier</key>
    <string>com.github.fishd72.download.azcopy-cli</string>
    <key>Input</key>
    <dict>
      <key>SOURCE_URL</key>
      <string>https://learn.microsoft.com/en-us/azure/storage/common/storage-use-azcopy-v10</string>
      <key>URL_REGEX</key>
      <string>https.*?azcopy-v10-mac</string>
      <key>ARCH</key>
      <string>-arm64</string>
      <key>VER_REGEX</key>
      <string>^.*\/azcopy_darwin_a..64_([0-9.]+)\.zip</string> 
    </dict>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>URLTextSearcher</string>
        <key>Arguments</key>
        <dict>
          <key>url</key>
          <string>%SOURCE_URL%</string>
          <key>re_pattern</key>
          <string>%URL_REGEX%%ARCH%</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
          <key>url</key>
          <string>%match%</string>
          <key>prefetch_filename</key>
          <string>true</string>
          <key>curl_opts</key>
            <array>
              <string>-L</string>
            </array>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>com.github.jazzace.processors/TextSearcher</string>
        <key>Arguments</key>
        <dict>
          <key>text_in</key>
          <string>%pathname%</string>
          <key>re_pattern</key>
          <string>%VER_REGEX%</string>
          <key>result_output_var_name</key>
          <string>version</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
    </array>
  </dict> 
</plist>
