<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Ghost.</string>
	<key>Identifier</key>
	<string>com.github.fishd72.download.Ghost</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://github-production-release-asset-2e65be.s3.amazonaws.com/42172597/a95b2bf4-9d49-11e8-8fb9-f1f99970bb07?X-Amz-Algorithm=AWS4-HMAC-SHA256&amp;X-Amz-Credential=AKIAIWNJYAX4CSVEH53A%2F20181130%2Fus-east-1%2Fs3%2Faws4_request&amp;X-Amz-Date=20181130T130954Z&amp;X-Amz-Expires=300&amp;X-Amz-Signature=2a56812b7547574c23342b47c71edc26f3cae341b5b47431652498646021834e&amp;X-Amz-SignedHeaders=host&amp;actor_id=17091283&amp;response-content-disposition=attachment%3B%20filename%3Dghost-desktop-1.7.0-osx.dmg&amp;response-content-type=application%2Foctet-stream</string>
		<key>NAME</key>
		<string>Ghost</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Ghost.app</string>
				<key>requirement</key>
				<string>identifier "com.electron.ghost" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "6RKE5ET24A"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Ghost.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
