<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Ghost.</string>
	<key>Identifier</key>
	<string>com.github.fishd72.download.Ghost</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ghost-desktop</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>The Ghost Desktop app is no longer available (details: https://forum.ghost.org/t/has-the-ghost-native-app-for-desktop-disappeared/16990). This recipe is deprecated and will be removed in the future.</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>%NAME%-[\S]+\.dmg</string>
				<key>github_repo</key>
				<string>TryGhost/Ghost-Desktop</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%url%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Ghost.app</string>
				<key>requirement</key>
				<string>identifier "com.electron.ghost" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "6RKE5ET24A"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Ghost.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
