<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Identifier</key>
		<string>com.github.fishd72.pkg.EmacsForOSX</string>
		<key>Input</key>
		<dict>
			<key>APP_FILENAME</key>
			<string>Emacs</string>
			<key>BUNDLE_ID</key>
			<string>org.gnu.Emacs</string>
			<key>NAME</key>
			<string>Emacs</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.48kRAM.autopkg.download.emacsformacosx</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>AppPkgCreator</string>
			</dict>
		</array>
	</dict>
</plist>
