<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of x2Go client and creates a package.</string>
    <key>Comment</key>
    <string>This recipe downloads an unsigned app from an insecure website. Use at your own risk!</string>
    <key>Identifier</key>
	<string>com.github.fishd72.pkg.x2Go</string>
	<key>Input</key>
	<dict>
        <key>NAME</key>
        <string>x2Go</string>
        <key>FORCEDBUNDLEID</key>
        <string>org.x2go.client</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.fishd72.download.x2Go</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Arguments</key>
            <dict>
                <key>bundleid</key>
                <string>%FORCEDBUNDLEID%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
