<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Freeplane and creates a package.</string>
		<key>Identifier</key>
		<string>com.github.fishd72.pkg.Freeplane</string>
		<key>Input</key>
		<dict>
			<key>BUNDLE_ID</key>
			<string>org.freeplane.core</string>
			<key>NAME</key>
			<string>Freeplane</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.fishd72.download.Freeplane</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				</dict>
				<key>Processor</key>
				<string>AppPkgCreator</string>
			</dict>
		</array>
	</dict>
</plist>
